# ButtonData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ButtonData Properties
ButtonData Class See Also
---
The ButtonData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Image | The image of the button. |
| LargeImage | The large image of the button. |
| LongDescription | Long description of the command tooltip  (Inherited from RibbonItemData.) |
| Name | The name of the item. (Inherited from RibbonItemData.) |
| Text | The user-visible text of the button. |
| ToolTip | The description that appears as a ToolTip for the item. (Inherited from RibbonItemData.) |
| ToolTipImage | The image to show as a part of the button extended tooltip  (Inherited from RibbonItemData.) |

# See Also
ButtonData Class
Autodesk.Revit.UI Namespace